namespace SystemProgrammingP47
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("System Programming");
            new ProcessDemo().Run();
        }
    }
}
/* Системне програмування: паралельні обчислення
 * Фізичні обмеження призводять до екстенсивного розвитку
 * техніки - замість прискорення одного процесора
 * встановлюється деяка їх кількість (типово - 8..20 шт).
 * Без паралельності неможливо використати увесь потенціал ПК.
 * 
 * Способи реалізації паралельних (асинхронних) обчислень:
 * мережеві технології (network) - розподіл задач по вузлах мережі
 *             (grid technology) - по складових суперкомп'ютерів
 * багатопроцесність - запуск кількох процесів для вирішення одної задачі
 * багатопоточність - ... кількох потоків ...
 * багатозадачність - використання програмних (платформних) об'єктів-задач
 * 
 * Процес (у програмуванні) - виконання програми. Багатопроцесність - 
 *  багаторазовий запуск програм(и)
 * Потоки (threads) - існують у межах процесів, відповідно, можуть 
 *  взаємодіяти між собою в рамках процесу
 */
